public enum UI {
    START_MENU("""
            ==========================================================
                                                                        
                        Kakao Tech BootCamp Cinema입니다.               
                                                                     
                              예매하시겠습니까?                          
                          1. Yes   /    2. No                        
                                                                      
                                                                     
            =========================================================="""),
    DIVIDING_LINE("""
                        
            ==========================================================
            """),
    SELECT_START("ㅁ 예매하시겠습니까? : "),
    SELECTING_MOVIE("ㅁ 원하시는 영화를 선택해주세요 : "),
    SELECTING_SCREENTIME("ㅁ 원하시는 상영시간을 선택해주세요 : "),
    SELECTING_SEAT("ㅁ 원하시는 좌석 선택해주세요 ex) A1 : "),
    SCREEN("========================스 크 린==========================="),
    PAYMENT_START("ㅁ 결제 도와드리겠습니다."),
    PAYMENT_REQUEST_INFO("ㅁ 결제하실 금액을 투입해주세요."),
    PAYMENT_REQUEST("ㅁ 결제하실 금액을 투입해주세요."),
    PAYMENT_INPUT_ERROR("ㅁ 결제금액과 투입금액이 맞지 않습니다. 다시 시도해주십시오. "),
    PAYMENT_INPUT("ㅁ 투입할 금액 입력 : "),
    PAYMENT_SUCCESS("""
            ==========================================================
                                                                        
                                               
                                결제가 완료되었습니다.                                     
                                이용해주셔서 감사합니다.                        
                                                      
                                                                      
                                                                     
            =========================================================="""),
    END_MENU("""
            ==========================================================
                                                                        
                                               
                                                                     
                                감사합니다.                        
                                                  
                                                                      
                                                                     
            =========================================================="""
    ),
    ERROR_MENU("""
            ==========================================================
                                                                        
                                               
                                                                     
                               다시 시도해주세요.                        
                                                  
                                                                      
                                                                     
            =========================================================="""
    );

    private final String ui;

    UI(String ui) {
        this.ui = ui;
    }

    public String display() {
        return ui;
    }

};
